src/InformationRegisters/ОчередьУведомленийСинтаксическойПроверки/ОчередьУведомленийСинтаксическойПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьУведомленийСинтаксическойПроверки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОперацийУведомлений</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектПроверки</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоПроверкаАПК</name>
    <comment>Маркер вида проверки. АПК или БСЛ-ЛС. Если Истина, то АПК.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РезультатыСинтаксическойПроверки/РезультатыСинтаксическойПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыСинтаксическойПроверки</name>
  <resources>
    <name>КоличествоОшибокАПК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПровереноАПК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибокBSL_LS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПровереноBSLLS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектПроверки</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыОперацийУведомлений/СтатусыОперацийУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОперацийУведомлений</name>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/АвтоматизированнаяПроверкаКодаСлужебный/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Предназначен для работы с системами автоматизации проверки кода. (АПК, SonarQube)
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьОпросАвтотестовОбработчикЗадания() Экспорт
	//ИмяПроцедуры = "АвтоматизированнаяПроверкаКода.ВыполнитьОпросАвтотестов";
	//НаименованиеФоновогоЗадания = "Опрос автотестов (в потоках)";
	//КлючФоновогоЗадания = "ОпросАвтотестовМногопоточно";
	//ПараметрыОбработкиЗаданий = 
	//	РаботаСХранилищамиСлужебный.ПараметрыМногопоточнойОбработкиЗаданий(НаименованиеФоновогоЗадания, КлючФоновогоЗадания);
	//Результат = ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков(
	//	ИмяПроцедуры,
	//	ПараметрыОбработкиЗаданий.ПараметрыВыполнения,
	//	ПараметрыОбработкиЗаданий.НаборПараметровПотоков);
	
	// Линейный запуск
	Выборка = РаботаСХранилищамиСлужебный.ПараметрыЛинейнойОбработкиЗаданий();
	Пока Выборка.Следующий() Цикл
		АвтоматизированнаяПроверкаКода.ВыполнитьОпросАвтотестов(Выборка.Хранилище);
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьИсториюХранилищаВАПКОбработчикЗадания() Экспорт
	//ИмяПроцедуры = "АвтоматизированнаяПроверкаКода.ОбновитьИсториюХранилищаВАПК";
	//НаименованиеФоновогоЗадания = "Обновление истории хранилища в АПК (в потоках)";
	//КлючФоновогоЗадания = "ОбновитьИсториюХранилищаВАПКМногопоточно";
	//ПараметрыОбработкиЗаданий = 
	//	РаботаСХранилищамиСлужебный.ПараметрыМногопоточнойОбработкиЗаданий(НаименованиеФоновогоЗадания, КлючФоновогоЗадания);
	//Результат = ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков(
	//	ИмяПроцедуры,
	//	ПараметрыОбработкиЗаданий.ПараметрыВыполнения,
	//	ПараметрыОбработкиЗаданий.НаборПараметровПотоков);
	
	// Линейный запуск
	Выборка = РаботаСХранилищамиСлужебный.ПараметрыЛинейнойОбработкиЗаданий();
	Пока Выборка.Следующий() Цикл
		АвтоматизированнаяПроверкаКода.ОбновитьИсториюХранилищаВАПК(Выборка.Хранилище);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьОшибкиАПКОбработчикЗадания() Экспорт
	//ИмяПроцедуры = "АвтоматизированнаяПроверкаКода.ЗагрузитьОшибкиАПК";
	//НаименованиеФоновогоЗадания = "Загрузка ошибок АПК (в потоках)";
	//КлючФоновогоЗадания = "ЗагрузитьОшибкиАПКМногопоточно";
	//ПараметрыОбработкиЗаданий = 
	//	РаботаСХранилищамиСлужебный.ПараметрыМногопоточнойОбработкиЗаданий(НаименованиеФоновогоЗадания, КлючФоновогоЗадания);
	//Результат = ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков(
	//	ИмяПроцедуры,
	//	ПараметрыОбработкиЗаданий.ПараметрыВыполнения,
	//	ПараметрыОбработкиЗаданий.НаборПараметровПотоков);
	
	// Линейный запуск
	Выборка = РаботаСХранилищамиСлужебный.ПараметрыЛинейнойОбработкиЗаданий();
	Пока Выборка.Следующий() Цикл
		АвтоматизированнаяПроверкаКода.ЗагрузитьОшибкиАПК(Выборка.Хранилище);
	КонецЦикла;
КонецПроцедуры

Процедура ОтправкаУведомленийСинтаксическойПроверкиОбработчикЗадания() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки КАК ОбъектПроверки,
		|	ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ЭтоПроверкаАПК КАК ЭтоПроверкаАПК,
		|	ВЫБОР
		|		КОГДА РезультатыСинтаксическойПроверки.ОбъектПроверки ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ЭтоПроверкаАПК
		|					ТОГДА РезультатыСинтаксическойПроверки.КоличествоОшибокАПК
		|				ИНАЧЕ РезультатыСинтаксическойПроверки.КоличествоОшибокBSL_LS
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОшибок,
		|	ВЫБОР
		|		КОГДА ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки ССЫЛКА Справочник.ИсторияХранилища
		|			ТОГДА ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
		|		ИНАЧЕ ВЫРАЗИТЬ(ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки КАК Справочник.ВерсииДополнений).Автор
		|	КОНЕЦ КАК Ответственный,
		|	ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки ССЫЛКА Справочник.ИсторияХранилища КАК ПроверкаВерсииИсторииХранилища,
		|	ВЫБОР
		|		КОГДА ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки ССЫЛКА Справочник.ИсторияХранилища
		|			ТОГДА ВЫРАЗИТЬ(ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки КАК Справочник.ИсторияХранилища).Код
		|		ИНАЧЕ ВЫРАЗИТЬ(ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки КАК Справочник.ВерсииДополнений).Наименование
		|	КОНЕЦ КАК ПредставлениеОбъекта,
		|	ВЫБОР
		|		КОГДА ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки ССЫЛКА Справочник.ИсторияХранилища
		|			ТОГДА ВЫРАЗИТЬ(ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки КАК Справочник.ИсторияХранилища).Владелец.Владелец.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки КАК Справочник.ВерсииДополнений).Владелец.Конфигурация.Наименование
		|	КОНЕЦ КАК ПредставлениеКонфигурации,
		|	ВЫБОР
		|		КОГДА ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки ССЫЛКА Справочник.ИсторияХранилища
		|			ТОГДА ВЫРАЗИТЬ(ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки КАК Справочник.ИсторияХранилища).Владелец.Наименование
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ХранилищеНаименование
		|ИЗ
		|	РегистрСведений.ОчередьУведомленийСинтаксическойПроверки.СрезПоследних КАК ОчередьУведомленийСинтаксическойПроверкиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РезультатыСинтаксическойПроверки КАК РезультатыСинтаксическойПроверки
		|		ПО ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки = РезультатыСинтаксическойПроверки.ОбъектПроверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО (ВЫРАЗИТЬ(ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки КАК Справочник.ИсторияХранилища).Автор = Пользователи.Код)
		|			И (ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.ОбъектПроверки ССЫЛКА Справочник.ИсторияХранилища)
		|ГДЕ
		|	ОчередьУведомленийСинтаксическойПроверкиСрезПоследних.Статус = &СтатусВОчереди";
	Запрос.УстановитьПараметр("СтатусВОчереди", Перечисления.СтатусыОперацийУведомлений.ВОчереди);
	Выборка = Запрос.Выполнить().Выбрать();
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ПараметрыПисьма = Новый Структура("Кому,Тема,Тело,ТипТекста");
	ПараметрыПисьма.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
	ШаблонТемы = "Результат синтаксической проверки (%1) ""%2"" %3 : %4.";
	
	Пока Выборка.Следующий() Цикл
		Попытка
			Если  Выборка.КоличествоОшибок = 0 Тогда
				КраткийРеузльтатВТеме = "Ошибок не обнаружено";
				ТелоПисьма = 
					"<html>
					|<head>
					|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
					|<title>Проверка коммита</title>
					|</head>
					|<body>
					|<h1>Коммит проверен, ошибок автоматической проверкой не обнаружено.</h2>
					|</body>
					|</html>";
			Иначе
				КраткийРеузльтатВТеме = СтрШаблон("Обнаружено %1 ошибок", Выборка.КоличествоОшибок);
				Если Выборка.ЭтоПроверкаАПК Тогда
					ОтчетПроверки = АвтоматизированнаяПроверкаКода.ПолучитьДанныеПроверкиАПК(Выборка.ПредставлениеОбъекта, Выборка.ХранилищеНаименование);
				Иначе
					ОтчетПроверки = СинтаксическаяПроверкаBSLLS.ОшибкиПоКоммиту(Выборка.ОбъектПроверки);
				КонецЕсли;
				ТелоПисьма = ОбщегоНазначенияКлиентСерверУК.ПолучитьHTMLИзТабличногоДокумента(ОтчетПроверки);
			КонецЕсли;
			
			СистемаПроверки = ?(Выборка.ЭтоПроверкаАПК, "АПК", "BSL-LS");
			Тема = СтрШаблон(ШаблонТемы, СистемаПроверки, Выборка.ПредставлениеОбъекта, Выборка.ПредставлениеКонфигурации, КраткийРеузльтатВТеме);
			АдресЭП = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				Выборка.Ответственный,
				Справочники.ВидыКонтактнойИнформации.EmailПользователя,
				,
				,
				Новый Структура("ТолькоПервая", Истина));
			Если ЗначениеЗаполнено(АдресЭП) Тогда
				ПараметрыПисьма.Кому = АдресЭП;
				ПараметрыПисьма.Тема = Тема;
				ПараметрыПисьма.Тело = ТелоПисьма;
				Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
				РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);
			КонецЕсли;
			
			Менеджер = РегистрыСведений.ОчередьУведомленийСинтаксическойПроверки.СоздатьМенеджерЗаписи();
			Менеджер.Период = ТекущаяДатаСеанса();
			Менеджер.ОбъектПроверки = Выборка.ОбъектПроверки;
			Менеджер.ЭтоПроверкаАПК = Выборка.ЭтоПроверкаАПК;
			Менеджер.Статус = Перечисления.СтатусыОперацийУведомлений.Выполнено;
			Менеджер.Записать(Ложь);
		Исключение
			ЗаписьЖурналаРегистрации(
				"Отправка уведомлений синтаксической проверки",
				УровеньЖурналаРегистрации.Ошибка,
				,
				Выборка.ОбъектПроверки,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
